<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current standalone Microsoft OneDrive installer, extracts version information and renames the installer package</string>
	<key>Identifier</key>
	<string>com.github.sumit.pkg.MSOneDrive</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Microsoft OneDrive</string>
		<key>VENDOR</key>
		<string>Microsoft</string>
		<key>SOFTWARETITLE</key>
		<string>OneDrive</string>
		<key>version</key>
		<string>%version%</string>
	</dict>
	<key>MiniumumVersion</key>
	<string>0.6.0</string>
	<key>ParentRecipe</key>
	<string>com.github.rtrouton.download.microsoftonedrive</string>
	<key>Process</key>
	<array>
		<dict>
				<key>Processor</key>
				<string>FlatPkgUnpacker</string>
				<key>Arguments</key>
				<dict>
						<key>flat_pkg_path</key>
						<string>%pathname%</string>
						<key>destination_path</key>
						<string>%RECIPE_CACHE_DIR%/unpack</string>
				</dict>
		</dict>
		<dict>
				<key>Processor</key>
				<string>PkgPayloadUnpacker</string>
				<key>Arguments</key>
				<dict>
						<key>pkg_payload_path</key>
						<string>%RECIPE_CACHE_DIR%/unpack/%SOFTWARETITLE%.pkg/Payload</string>
						<key>destination_path</key>
						<string>%RECIPE_CACHE_DIR%/payload</string>
				</dict>
		</dict>
		<dict>
				<key>Processor</key>
				<string>Versioner</string>
				<key>Arguments</key>
				<dict>
						<key>input_plist_path</key>
						<string>%RECIPE_CACHE_DIR%/payload/%SOFTWARETITLE%.app/Contents/Info.plist</string>
						<key>plist_version_key</key>
						<string>CFBundleShortVersionString</string>
				</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0775</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%pkgroot%/Applications/%SOFTWARETITLE%.app</string>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/%SOFTWARETITLE%.app</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array>
						<dict>
							<key>group</key>
							<string>admin</string>
							<key>path</key>
							<string>Applications</string>
							<key>user</key>
							<string>root</string>
						</dict>
					</array>
					<key>id</key>
					<string>com.microsoft.onedrive</string>
					<key>options</key>
					<string>purge_ds_store</string>
					<key>pkgname</key>
					<string>%VENDOR%_%SOFTWARETITLE%_%version%.pkg</string>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
